In [1]:
#importing modules
import pandas as pd
import numpy as np

In [2]:
# create dictionary
dict1 = {
    'name' : ['Dhrupal','Nikunj','Vipul','Mehul'],
    'marks' : [26, 27, 25, 23],
    'city' : ['Mehsana','Visnagar','Somnath','Vijapur']
}

In [3]:
# create dataframe
df = pd.DataFrame(dict1)
df

      name  marks      city
0  Dhrupal     26   Mehsana
1   Nikunj     27  Visnagar
2    Vipul     25   Somnath
3    Mehul     23   Vijapur

In [4]:
# change index
df.index = ['I','II','III','IV']

In [5]:
df

        name  marks      city
I    Dhrupal     26   Mehsana
II    Nikunj     27  Visnagar
III    Vipul     25   Somnath
IV     Mehul     23   Vijapur

In [6]:
# reset the index
df.reset_index(drop=True,inplace=True)

In [7]:
df

      name  marks      city
0  Dhrupal     26   Mehsana
1   Nikunj     27  Visnagar
2    Vipul     25   Somnath
3    Mehul     23   Vijapur

In [8]:
# write data to csv file
df.to_csv('friends_data.csv')

In [9]:
# show uppermost data using head
df.head(2)

      name  marks      city
0  Dhrupal     26   Mehsana
1   Nikunj     27  Visnagar

In [10]:
# show lowermost data using tail
df.tail(2)

    name  marks     city
2  Vipul     25  Somnath
3  Mehul     23  Vijapur

In [11]:
# to have statstical summary of numerical fields
df.describe()

           marks
count   4.000000
mean   25.250000
std     1.707825
min    23.000000
25%    24.500000
50%    25.500000
75%    26.250000
max    27.000000

In [12]:
dict2 = {
    'car' : ['i20','i10','bmw','mercedeze'],
    'speed': [100,80,160,180],
    'pricec' : [8,4,30,35]
}

In [13]:
df2 = pd.DataFrame(dict2)
df2

         car  speed  pricec
0        i20    100       8
1        i10     80       4
2        bmw    160      30
3  mercedeze    180      35

In [14]:
#write data to csv without index as a column
df2.to_csv('car_details.csv',index=False)

In [15]:
df3 = pd.read_csv('car_details.csv')

In [16]:
df3

         car  speed  pricec
0        i20    100       8
1        i10     80       4
2        bmw    160      30
3  mercedeze    180      35

In [17]:
# access particular column
df3['speed']

0    100
1     80
2    160
3    180
Name: speed, dtype: int64

In [18]:
# access data
df3['speed'][0]

100

In [19]:
# change data
df3['speed'][0] = 110

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [20]:
df3

         car  speed  pricec
0        i20    110       8
1        i10     80       4
2        bmw    160      30
3  mercedeze    180      35

In [21]:
# series 1-D array in pandas
series = pd.Series([1,2,3,4])
series

0    1
1    2
2    3
3    4
dtype: int64

In [22]:
# check type of Series
type(series)

pandas.core.series.Series

In [23]:
# dataframe 2-D array in pandas (collections of 1 or more series)
df = pd.DataFrame([1,2,3,4,5])

In [24]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df = pd.DataFrame(np.random.rand(10,5),index=np.arange(0,10))
df

          0         1         2         3         4
0  0.188747  0.833095  0.032286  0.426277  0.971653
1  0.723830  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154
5  0.599576  0.861406  0.763150  0.420982  0.931259
6  0.647388  0.286426  0.345677  0.542107  0.215368
7  0.852220  0.507157  0.106748  0.347513  0.955312
8  0.686396  0.944195  0.723955  0.969264  0.693541
9  0.582902  0.794758  0.930967  0.075003  0.406868

In [27]:
df.describe()

               0          1          2          3          4
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.579136   0.569523   0.585760   0.506626   0.666773
std     0.238699   0.337350   0.314098   0.260751   0.309278
min     0.110973   0.081085   0.032286   0.075003   0.215368
25%     0.587070   0.318348   0.412755   0.365880   0.422269
50%     0.666892   0.650958   0.710480   0.449066   0.762964
75%     0.702230   0.854328   0.803512   0.678237   0.949298
max     0.852220   0.944195   0.930967   0.969264   0.971653

In [28]:
df

          0         1         2         3         4
0  0.188747  0.833095  0.032286  0.426277  0.971653
1  0.723830  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154
5  0.599576  0.861406  0.763150  0.420982  0.931259
6  0.647388  0.286426  0.345677  0.542107  0.215368
7  0.852220  0.507157  0.106748  0.347513  0.955312
8  0.686396  0.944195  0.723955  0.969264  0.693541
9  0.582902  0.794758  0.930967  0.075003  0.406868

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
# datatypes of all columns
df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
# change content of row1-col1 data
df[0][0]= 'abc'

In [32]:
df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
df[0][0]=np.random.rand()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [34]:
# all index
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [35]:
# all columns
df.columns

RangeIndex(start=0, stop=5, step=1)

In [36]:
df

          0         1         2         3         4
0  0.806376  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154
5  0.599576  0.861406  0.763150  0.420982  0.931259
6  0.647388  0.286426  0.345677  0.542107  0.215368
7   0.85222  0.507157  0.106748  0.347513  0.955312
8  0.686396  0.944195  0.723955  0.969264  0.693541
9  0.582902  0.794758  0.930967  0.075003  0.406868

In [37]:
# to convert dataframe to numpy array
df.to_numpy()

array([[0.80637595024991, 0.8330946155054731, 0.03228576391037907,
        0.42627697770164374, 0.9716529650944705],
       [0.7238304692350845, 0.8852013202829708, 0.8169659610103951,
        0.2998629587570669, 0.8323876630362017],
       [0.6945370218420339, 0.08779532516149513, 0.6970047463390379,
        0.72361385055624, 0.23171871024487],
       [0.7047949046729732, 0.08108495822451978, 0.8268621021954732,
        0.4718544056010877, 0.46847269585080364],
       [0.11097337253137718, 0.41411330725415385, 0.6139903807644107,
        0.7897856060050886, 0.9611542900909124],
       [0.5995757821552938, 0.8614058834911805, 0.7631497108180754,
        0.4209821187028735, 0.9312589875150651],
       [0.6473882246595458, 0.28642646235689073, 0.3456765039744579,
        0.5421070882361669, 0.21536823745978728],
       [0.8522197161115905, 0.5071572377545527, 0.10674751950645944,
        0.34751326706401464, 0.9553115534675327],
       [0.6863962299973264, 0.9441947822190566, 0.7239546842859115,
        0.9692636746848122, 0.6935405833046163],
       [0.582901660124562, 0.794758453216709, 0.9309673659282008,
        0.0750033382541031, 0.40686805005059434]], dtype=object)

In [38]:
# transpose dataframe like array
df.T

,0,1,2,3,4,5,6,7,8,9
0,0.806376,0.72383,0.694537,0.704795,0.110973,0.599576,0.647388,0.85222,0.686396,0.582902
1,0.833095,0.885201,0.0877953,0.081085,0.414113,0.861406,0.286426,0.507157,0.944195,0.794758
2,0.0322858,0.816966,0.697005,0.826862,0.61399,0.76315,0.345677,0.106748,0.723955,0.930967
3,0.426277,0.299863,0.723614,0.471854,0.789786,0.420982,0.542107,0.347513,0.969264,0.0750033
4,0.971653,0.832388,0.231719,0.468473,0.961154,0.931259,0.215368,0.955312,0.693541,0.406868

In [39]:
df

          0         1         2         3         4
0  0.806376  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154
5  0.599576  0.861406  0.763150  0.420982  0.931259
6  0.647388  0.286426  0.345677  0.542107  0.215368
7   0.85222  0.507157  0.106748  0.347513  0.955312
8  0.686396  0.944195  0.723955  0.969264  0.693541
9  0.582902  0.794758  0.930967  0.075003  0.406868

In [40]:
# shallow copy
newdf = df

In [41]:
# changes reflect in df too
newdf[0][0] = 108

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [42]:
df.head()

          0         1         2         3         4
0       108  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154

In [43]:
# reset value
newdf[0][0] = np.random.rand()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [44]:
df.head()

          0         1         2         3         4
0  0.920275  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154

In [45]:
# deep copy 
newdf1 = df.copy(deep=True)
newdf1.head()

          0         1         2         3         4
0  0.920275  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154

In [46]:
# changes only done in newdf1 becuase we have used deep copy
newdf1[0][0] = 108

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [47]:
df.head()

          0         1         2         3         4
0  0.920275  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154

In [48]:
# again it's shallow copy
newdf3 = df.copy(deep=False)
newdf3[0][0]=123

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [49]:
# reflected on both dataframes
df.head()

          0         1         2         3         4
0       123  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154

In [50]:
# reset value
newdf3[0][0] = np.random.rand()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [51]:
df.head()

          0         1         2         3         4
0  0.504851  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473
4  0.110973  0.414113  0.613990  0.789786  0.961154

In [52]:
df = df[0:4]
df

          0         1         2         3         4
0  0.504851  0.833095  0.032286  0.426277  0.971653
1   0.72383  0.885201  0.816966  0.299863  0.832388
2  0.694537  0.087795  0.697005  0.723614  0.231719
3  0.704795  0.081085  0.826862  0.471854  0.468473

In [53]:
# change names of index
df.index = ['1st','2nd','3rd','4th']
df

            0         1         2         3         4
1st  0.504851  0.833095  0.032286  0.426277  0.971653
2nd   0.72383  0.885201  0.816966  0.299863  0.832388
3rd  0.694537  0.087795  0.697005  0.723614  0.231719
4th  0.704795  0.081085  0.826862  0.471854  0.468473

In [54]:
# to retrieve data or change the data we use loc function
# loc function takes row value and column as argument (not based on index)
df.loc['2nd',0]

0.7238304692350845

In [55]:
# change value of 4th row and 5th column
df.loc['4th',4] = 112233
df

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

            0         1         2         3              4
1st  0.504851  0.833095  0.032286  0.426277       0.971653
2nd   0.72383  0.885201  0.816966  0.299863       0.832388
3rd  0.694537  0.087795  0.697005  0.723614       0.231719
4th  0.704795  0.081085  0.826862  0.471854  112233.000000

In [56]:
# drop 5th column (1 refers to column in dataframe)
df = df.drop(4,axis=1)

In [57]:
# drop 4th row (0 refers to row in dataframe)
df = df.drop('4th',axis=0)

In [58]:
df.index = [0,1,2]
df

          0         1         2         3
0  0.504851  0.833095  0.032286  0.426277
1   0.72383  0.885201  0.816966  0.299863
2  0.694537  0.087795  0.697005  0.723614

In [59]:
# print all columns and 1st row
df.loc[[1],:]

         0         1         2         3
1  0.72383  0.885201  0.816966  0.299863

In [60]:
# print all rows and 1st,last columns
df.loc[:,[0,3]]

          0         3
0  0.504851  0.426277
1   0.72383  0.299863
2  0.694537  0.723614

In [61]:
# print all values
df.loc[:]

          0         1         2         3
0  0.504851  0.833095  0.032286  0.426277
1   0.72383  0.885201  0.816966  0.299863
2  0.694537  0.087795  0.697005  0.723614

In [72]:
df.columns=[1,2,3,4]
df

          1         2         3         4
0  0.504851  0.833095  0.032286  0.426277
1   0.72383  0.885201  0.816966  0.299863
2  0.694537  0.087795  0.697005  0.723614

In [84]:
# select all the rows havng less then 0.7 in column1
df.loc[(df[1]<0.7)]

          1         2         3         4
0  0.504851  0.833095  0.032286  0.426277
2  0.694537  0.087795  0.697005  0.723614

In [86]:
# all rows having less than 0.7 and 0.5 in column1 and column4 respectively
df.loc[(df[1]<0.7) & (df[4]<0.5)]

          1         2         3         4
0  0.504851  0.833095  0.032286  0.426277

In [87]:
df

          1         2         3         4
0  0.504851  0.833095  0.032286  0.426277
1   0.72383  0.885201  0.816966  0.299863
2  0.694537  0.087795  0.697005  0.723614

In [89]:
# retreive values using index
df.iloc[0,0]

0.5048513543087231

In [94]:
# selected rows and selected columns
df.iloc[[0,2],[1,2]]

          2         3
0  0.833095  0.032286
2  0.087795  0.697005

In [95]:
# whole dataframe
df.iloc[:]

          1         2         3         4
0  0.504851  0.833095  0.032286  0.426277
1   0.72383  0.885201  0.816966  0.299863
2  0.694537  0.087795  0.697005  0.723614

In [101]:
# all rows and selected columns
df.iloc[:,[0,3]]

          1         4
0  0.504851  0.426277
1   0.72383  0.299863
2  0.694537  0.723614

In [102]:
# selected rows and all columns
df.iloc[[0,2],:]

          1         2         3         4
0  0.504851  0.833095  0.032286  0.426277
2  0.694537  0.087795  0.697005  0.723614

In [103]:
df

          1         2         3         4
0  0.504851  0.833095  0.032286  0.426277
1   0.72383  0.885201  0.816966  0.299863
2  0.694537  0.087795  0.697005  0.723614

In [104]:
# drop row in original dataframe using inplace=True
df.drop(0,axis=0,inplace=True)

In [105]:
df

          1         2         3         4
1   0.72383  0.885201  0.816966  0.299863
2  0.694537  0.087795  0.697005  0.723614

In [106]:
# drop row in original dataframe using inplace=True
df.drop(1,axis=1,inplace=True)
df

          2         3         4
1  0.885201  0.816966  0.299863
2  0.087795  0.697005  0.723614

In [109]:
df.reset_index(drop=True,inplace=True)
df

          2         3         4
0  0.885201  0.816966  0.299863
1  0.087795  0.697005  0.723614

In [111]:
# check null values
df.isnull()

       2      3      4
0  False  False  False
1  False  False  False

In [114]:
# create random valued array using numpy and give it as an i/p in dataframe
arr = np.random.rand(5,6)
newdf = pd.DataFrame(arr)

In [115]:
newdf

          0         1         2         3         4         5
0  0.843740  0.009349  0.124968  0.976596  0.042449  0.388362
1  0.685358  0.296527  0.098313  0.437735  0.603646  0.393527
2  0.294074  0.445193  0.267397  0.659321  0.471087  0.404889
3  0.240376  0.045178  0.049542  0.313186  0.301591  0.505175
4  0.390054  0.614963  0.440558  0.043072  0.725945  0.769527

In [118]:
# set 1st column values to NaN values
newdf[1] = np.NaN

In [119]:
newdf

          0   1         2         3         4         5
0  0.843740 NaN  0.124968  0.976596  0.042449  0.388362
1  0.685358 NaN  0.098313  0.437735  0.603646  0.393527
2  0.294074 NaN  0.267397  0.659321  0.471087  0.404889
3  0.240376 NaN  0.049542  0.313186  0.301591  0.505175
4  0.390054 NaN  0.440558  0.043072  0.725945  0.769527

In [120]:
#show null values in bool form
newdf.isnull()

       0     1      2      3      4      5
0  False  True  False  False  False  False
1  False  True  False  False  False  False
2  False  True  False  False  False  False
3  False  True  False  False  False  False
4  False  True  False  False  False  False

In [121]:
# to get sum of null values
newdf.isnull().sum()

0    0
1    5
2    0
3    0
4    0
5    0
dtype: int64

In [122]:
newdf

          0   1         2         3         4         5
0  0.843740 NaN  0.124968  0.976596  0.042449  0.388362
1  0.685358 NaN  0.098313  0.437735  0.603646  0.393527
2  0.294074 NaN  0.267397  0.659321  0.471087  0.404889
3  0.240376 NaN  0.049542  0.313186  0.301591  0.505175
4  0.390054 NaN  0.440558  0.043072  0.725945  0.769527

In [123]:
# drop NaN values and return copy
newdf.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5]
Index: []

In [124]:
newdf

          0   1         2         3         4         5
0  0.843740 NaN  0.124968  0.976596  0.042449  0.388362
1  0.685358 NaN  0.098313  0.437735  0.603646  0.393527
2  0.294074 NaN  0.267397  0.659321  0.471087  0.404889
3  0.240376 NaN  0.049542  0.313186  0.301591  0.505175
4  0.390054 NaN  0.440558  0.043072  0.725945  0.769527

In [125]:
# drop NaN column
newdf.dropna(axis=1)

          0         2         3         4         5
0  0.843740  0.124968  0.976596  0.042449  0.388362
1  0.685358  0.098313  0.437735  0.603646  0.393527
2  0.294074  0.267397  0.659321  0.471087  0.404889
3  0.240376  0.049542  0.313186  0.301591  0.505175
4  0.390054  0.440558  0.043072  0.725945  0.769527

In [126]:
newdf

          0   1         2         3         4         5
0  0.843740 NaN  0.124968  0.976596  0.042449  0.388362
1  0.685358 NaN  0.098313  0.437735  0.603646  0.393527
2  0.294074 NaN  0.267397  0.659321  0.471087  0.404889
3  0.240376 NaN  0.049542  0.313186  0.301591  0.505175
4  0.390054 NaN  0.440558  0.043072  0.725945  0.769527

In [141]:
dict1 = {
    'name':['bob','alice','mery','jaggu'],
    'native':['la',np.NaN,'nz',np.NaN],
    'money':[np.NaN]*4
}
df1 = pd.DataFrame(dict1)
df1

    name native  money
0    bob     la    NaN
1  alice    NaN    NaN
2   mery     nz    NaN
3  jaggu    NaN    NaN

In [143]:
# drop using how args
df1.dropna(how='all',axis=1)

    name native
0    bob     la
1  alice    NaN
2   mery     nz
3  jaggu    NaN

In [144]:
df1

    name native  money
0    bob     la    NaN
1  alice    NaN    NaN
2   mery     nz    NaN
3  jaggu    NaN    NaN

In [147]:
df1.iloc[0,0] = 'alice'

In [148]:
# drop _duplicates keep 1st record by default
df1.drop_duplicates(subset=['name'])

    name native  money
0  alice     la    NaN
2   mery     nz    NaN
3  jaggu    NaN    NaN

In [149]:
# drop _duplicates keep 2st record by default
df1.drop_duplicates(subset=['name'],keep='last')

    name native  money
1  alice    NaN    NaN
2   mery     nz    NaN
3  jaggu    NaN    NaN

In [150]:
# drop all duplicates names
df1.drop_duplicates(subset=['name'],keep=False)

    name native  money
2   mery     nz    NaN
3  jaggu    NaN    NaN

In [151]:
# all informations about dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   native  2 non-null      object
 2   money   0 non-null      float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [152]:
# count all key values of name column
df1['name'].value_counts()

alice    2
mery     1
jaggu    1
Name: name, dtype: int64

In [156]:
# count all key values of native column with NaN values
df1['native'].value_counts(dropna=False)

NaN    2
nz     1
la     1
Name: native, dtype: int64

In [157]:
# count all key values of native column without NaN values
df1['native'].value_counts(dropna=True)

nz    1
la    1
Name: native, dtype: int64

In [ ]:
ss